package ru.crystals.disinsector2.test.dataproviders;

import org.testng.annotations.DataProvider;


public class TableReportsDataprovider {
	
	@DataProvider (name = "Шапка отчета Рекламные акции")
	public static Object[][] adverstingReportTableHead() {
		return new Object[][] {
		{"Отчёт по товарам в рекламных акциях"},
		{"Тип скидки"},
		{"Код товара"},
		{"Группа продаж"},
		{"Товар в группе"},
		{"Цена 1"},
		{"Цена 2"},
		{"Цена 3"},
		{"Цена 4"},
		{"% скидки"},
		{"Код акции"},
		{"Цена по акции"},
		{"Название акции"},
		{"Название товара"},
		{"Начало акции"},
		{"Окончание акции"},
		{"Номер ТК"}
		};	
	}
	
	@DataProvider (name = "Шапка отчета Прайс чекеры")
	public static Object[][] priceCheckerTableHead() {
		return new Object[][] {
		{"Отчёт для Прайс чекеров"},
		{"№ ТК"},
		{"Дата"},
		{"Время"},
		{"MAC адрес"},
		{"Прайс Чекер"},
		{"Штрихкод"},
		{"Код товара"},
		{"Наименование"},
		};	
	}
	
	@DataProvider (name = "Шапка отчета Товары на ТК")
	public static Object[][] goodOnTKTableHead() {
		return new Object[][] {
		{"Отчёт по товару"},
		{"Id товара"},
		{"Короткое название"},
		{"Полное название"},
		{"Поставщик"},
		{"Подгруппа"},
		{"Прогрузка"},
		{"Страна"},
		{"Товар на полке:"},
		{"Штрих-код"},
		{"Ед. изм."},
		{"Срок от"},
		{"Срок до"},
		{"Основной"},
		{"Загрузка на весы"},
		{"Цена 1"},
		{"Цена 2"},
		{"Цена"},
		{"Валюта"},
		{"Начало периода"},
		{"Конец периода"},
		{"Номер цены"},
		{"Акция"},
		{"Ед. изм."},
		{"Начало"},
		{"Окончание"},
		{"Тип акции"},
		};	
	}
	
	@DataProvider (name = "Шапка отчета по возвратам")
	public static Object[][] refundChecksTableHead() {
		return new Object[][] {
		{"Отчёт по возвратам"},
		{"Заявление"},
		{"№ п/п"},
		{"№ Заявления"},
		{"Обьяснительная"},
		{"Чек Возврата"},
		{"Дата"},
		{"№ кассы"},
		{"№ смены"},
		{"№ чека"},
		{"ФИО В. кассира"},
		{"Сумма (руб.)"},
		{"Чек Продажи"},
		{"Дата"},
		{"№ кассы"},
		{"№ смены"},
		{"№ чека"},
		{"Товар"},
		{"Наименование товара"},
		{"Код товара"},
		{"Причина"},
		{"Примечание"},
		{"Отдел"},
		{"возврат/ обмен"},
		{"Ответственный за возврат"},
		};	
	}
	
	@DataProvider (name = "Шапка отчета по количеству PLU в весах")
	public static Object[][] pluReportTableHead() {
		return new Object[][] {
		{"Отчёт по количеству PLU в весах на ТК"},
		{"Номер ТК"},
		{"Шаблон весов"},
		{"Номер Весов"},
		{"IP адрес весов"},
		{" Количество PLU в весах"},
		};	
	}
	
}

